In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'age':[30, 2, 12, 4, 32, 33, 69],
                   'color':['blue', 'green', 'red', 'white', 'gray', 'black', 'red'],
                   'food':['Steak', 'Lamb', 'Mango', 'Apple', 'Cheese', 'Melon', 'Beans'],
                   'height':[165, 70, 120, 80, 180, 172, 150],
                   'score':[4.6, 8.3, 9.0, 3.3, 1.8, 9.5, 2.2],
                   'state':['NY', 'TX', 'FL', 'AL', 'AK', 'TX', 'TX']
                   },
                  index=['Jane', 'Nick', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'])

In [3]:
df

           age  color    food  height  score state
Jane        30   blue   Steak     165    4.6    NY
Nick         2  green    Lamb      70    8.3    TX
Aaron       12    red   Mango     120    9.0    FL
Penelope     4  white   Apple      80    3.3    AL
Dean        32   gray  Cheese     180    1.8    AK
Christina   33  black   Melon     172    9.5    TX
Cornelia    69    red   Beans     150    2.2    TX

In [4]:
df.loc['Nick']

age           2
color     green
food       Lamb
height       70
score       8.3
state        TX
Name: Nick, dtype: object

In [5]:
df.loc['Nick']['color']

'green'

In [6]:
df.iloc[1]

age           2
color     green
food       Lamb
height       70
score       8.3
state        TX
Name: Nick, dtype: object

### Simultaneous selection of rows and columns with .loc and .iloc

In [10]:
df.loc[['Jane', 'Dean'], ['height']]

      height
Jane     165
Dean     180

In [8]:
df.loc[['Jane', 'Dean'], 'height':]

      height  score state
Jane     165    4.6    NY
Dean     180    1.8    AK

In [15]:
df.loc[['Jane', 'Dean'], ['height','age']]

      height  age
Jane     165   30
Dean     180   32

In [16]:
df.iloc[[1,4], 2]

Nick      Lamb
Dean    Cheese
Name: food, dtype: object

In [25]:
cols = df.columns[[2,4]]
df.loc[['Nick', 'Cornelia'],cols]

           food  score
Nick       Lamb    8.3
Cornelia  Beans    2.2

In [24]:
df.loc[df['age'] > 30, ['food', 'score']]

             food  score
Dean       Cheese    1.8
Christina   Melon    9.5
Cornelia    Beans    2.2

In [26]:
df.iloc[(df['age'] > 30).values, [2, 4]]

             food  score
Dean       Cheese    1.8
Christina   Melon    9.5
Cornelia    Beans    2.2

In [27]:
df.loc[:, 'color':'score':2]

           color  height
Jane        blue     165
Nick       green      70
Aaron        red     120
Penelope   white      80
Dean        gray     180
Christina  black     172
Cornelia     red     150

In [28]:
df[['food', 'score']]

             food  score
Jane        Steak    4.6
Nick         Lamb    8.3
Aaron       Mango    9.0
Penelope    Apple    3.3
Dean       Cheese    1.8
Christina   Melon    9.5
Cornelia    Beans    2.2

In [29]:
df['Penelope':'Christina'] # slice rows by label

           age  color    food  height  score state
Penelope     4  white   Apple      80    3.3    AL
Dean        32   gray  Cheese     180    1.8    AK
Christina   33  black   Melon     172    9.5    TX

In [38]:
df[2:6:2] # slice rows by integer location

       age color    food  height  score state
Aaron   12   red   Mango     120    9.0    FL
Dean    32  gray  Cheese     180    1.8    AK